In [2]:
import pandas as pd
nba=pd.read_csv('nba.csv')
#Here we are not using squeeze or uscols type attribute and 
#by looking at the data set it is clear that it contains missing value NaN
#we are going to pre process this before actual modelling.
# nba.head()
nba.tail(10)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
448,Gordon Hayward,Utah Jazz,20.0,SF,26.0,6-8,226.0,Butler,15409570.0
449,Rodney Hood,Utah Jazz,5.0,SG,23.0,6-8,206.0,Duke,1348440.0
450,Joe Ingles,Utah Jazz,2.0,SF,28.0,6-8,226.0,NaN,2050000.0
451,Chris Johnson,Utah Jazz,23.0,SF,26.0,6-6,206.0,Dayton,981348.0
452,Trey Lyles,Utah Jazz,41.0,PF,20.0,6-10,234.0,Kentucky,2239800.0
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [4]:
# nba.index
nba.shape
#it gives column and row
# nba.dtypes
# it gives object for str
# # # # # # #Below are some attributes which are made for Dataframes only
# nba.columns
# nba.axes
# it givrs index and column
# nba.info
nba.info()
#it gives full info

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 458 entries, 0 to 457
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      457 non-null    object
 1   Team      457 non-null    object
 2   Number    457 non-null    float64
 3   Position  457 non-null    object
 4   Age       457 non-null    float64
 5   Height    457 non-null    object
 6   Weight    457 non-null    float64
 7   College   373 non-null    object
 8   Salary    446 non-null    float64
dtypes: float64(4), object(5)
memory usage: 32.3+ KB

# shared method and column access in pandas

In [5]:
import pandas as pd
rev=pd.read_csv('revenue.csv', index_col='Date')
rev.head(10)

         New York  Los Angeles  Miami
Date
1/1/16        985          122    499
1/2/16        738          788    534
1/3/16         14           20    933
1/4/16        730          904    885
1/5/16        114           71    253
1/6/16        936          502    497
1/7/16        123          996    115
1/8/16        935          492    886
1/9/16        846          954    823
1/10/16        54          285    216

In [6]:
rev.sum() #Here data is added in terms of column wise
rev.sum(axis=1)
rev.sum(axis='index')

New York       5475
Los Angeles    5134
Miami          5641
dtype: int64

In [ ]:
# rev.sum(axis=1)
rev.sum(axis='columns')

In [23]:
nba=pd.read_csv('nba.csv')
nba.head()

#If i want to extract data column wise
type(nba.Salary) #Its data type is series as it is a single dimension array it works properly when there is no space in column name

pandas.core.series.Series

In [7]:
type(nba.Name)

pandas.core.series.Series

In [8]:
# nba['Name'] #It is more accurate as it works for those column also which have space in there name
nba.Name

0      Avery Bradley
1        Jae Crowder
2       John Holland
3        R.J. Hunter
4      Jonas Jerebko
           ...
453     Shelvin Mack
454        Raul Neto
455     Tibor Pleiss
456      Jeff Withey
457              NaN
Name: Name, Length: 458, dtype: object

In [28]:
# nba[['Team', 'Name']]
# select=['Team', 'Name']
nba[select]

               Team           Name
0    Boston Celtics  Avery Bradley
1    Boston Celtics    Jae Crowder
2    Boston Celtics   John Holland
3    Boston Celtics    R.J. Hunter
4    Boston Celtics  Jonas Jerebko
..              ...            ...
453       Utah Jazz   Shelvin Mack
454       Utah Jazz      Raul Neto
455       Utah Jazz   Tibor Pleiss
456       Utah Jazz    Jeff Withey
457             NaN            NaN

[458 rows x 2 columns]

# Add new column to data frames

In [29]:
import pandas as pd
nba=pd.read_csv('nba.csv')
nba.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

In [30]:
nba['Sports']='Basket Ball' #One method to add column but by this column is added at the last
nba.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary,Sports
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0,Basket Ball
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0,Basket Ball
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN,Basket Ball
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0,Basket Ball
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0,Basket Ball

In [9]:

nba=pd.read_csv('nba.csv')
#Insert method : any specific place you may add your column
nba.insert(3, column="League", value="IPL")
nba.League[[0,1]]=["Hello","test"]
nba.head()

C:\Users\Parekh\AppData\Local\Temp\ipykernel_14972\4069644177.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  nba.League[[0,1]]=["Hello","test"]

,Name,Team,Number,League,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,Hello,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,test,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,IPL,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,IPL,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,IPL,PF,29.0,6-10,231.0,NaN,5000000.0

# BroadCasting operation in pandas

In [32]:
#Broadcasting : means to perform operation in whole series of a column
import pandas as pd
nba=pd.read_csv('nba.csv')
nba.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

In [5]:
# nba['Salary'].sub(50000)
nba['Salary']-50000


# nba['Age'].add(5)
# nba['Age']+5


# nba['Weight'].mul(0.453)
# nba['Weight']*0.453



# nba["Weight in KG"]=nba['Weight']*0.453592
# nba.head()

0      7680337.0
1      6746117.0
2            NaN
3      1098640.0
4      4950000.0
         ...
453    2383333.0
454     850000.0
455    2850000.0
456     897276.0
457          NaN
Name: Salary, Length: 458, dtype: float64

# Drops Rows with Null Values

In [6]:
import pandas as pd
nba=pd.read_csv('nba.csv')
nba.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

In [7]:
nba.tail()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [15]:
# nba.dropna()
# nba.dropna(how='any', inplace = True)
nba.dropna(how='all', inplace=True)
nba.tail()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
452,Trey Lyles,Utah Jazz,41.0,PF,20.0,6-10,234.0,Kentucky,2239800.0
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0

In [18]:
nba.dropna(axis=1, inplace=True) #It deletes column which consists NaN
nba.head()

            Name            Team  Number Position   Age Height  Weight
0  Avery Bradley  Boston Celtics     0.0       PG  25.0    6-2   180.0
1    Jae Crowder  Boston Celtics    99.0       SF  25.0    6-6   235.0
2   John Holland  Boston Celtics    30.0       SG  27.0    6-5   205.0
3    R.J. Hunter  Boston Celtics    28.0       SG  22.0    6-5   185.0
4  Jonas Jerebko  Boston Celtics     8.0       PF  29.0   6-10   231.0

In [20]:
nba.dropna(subset=['Salary'])

KeyError: ['Salary']

# fillna method for Null Values

In [21]:
import pandas as pd
nba=pd.read_csv('nba.csv')
nba.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

In [22]:
nba.fillna(0).head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,0.0
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,0,5000000.0

In [23]:
nba['Salary']
nba['Salary'].fillna(0, inplace=True)
nba.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,0.0
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

In [24]:
nba['College'].fillna('No College', inplace=True)
nba
# imp

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,0.0
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,No College,5000000.0
...,...,...,...,...,...,...,...,...,...
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,No College,900000.0
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,No College,2900000.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,No College,0.0

# sort_values() method in Data Frames

In [25]:
import pandas as pd
nba=pd.read_csv('nba.csv')
nba.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

In [27]:
nba.sort_values('Name', ascending=True).head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
152,Aaron Brooks,Chicago Bulls,0.0,PG,31.0,6-0,161.0,Oregon,2250000.0
356,Aaron Gordon,Orlando Magic,0.0,PF,20.0,6-9,220.0,Arizona,4171680.0
328,Aaron Harrison,Charlotte Hornets,9.0,SG,21.0,6-6,210.0,Kentucky,525093.0
404,Adreian Payne,Minnesota Timberwolves,33.0,PF,25.0,6-10,237.0,Michigan State,1938840.0
312,Al Horford,Atlanta Hawks,15.0,C,30.0,6-10,245.0,Florida,12000000.0

In [28]:
nba.sort_values('Age')
nba.sort_values('Age', ascending=True)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
226,Rashad Vaughn,Milwaukee Bucks,20.0,SG,19.0,6-6,202.0,UNLV,1733040.0
122,Devin Booker,Phoenix Suns,1.0,SG,19.0,6-6,206.0,Kentucky,2127840.0
40,Kristaps Porzingis,New York Knicks,6.0,PF,20.0,7-3,240.0,NaN,4131720.0
401,Tyus Jones,Minnesota Timberwolves,1.0,PG,20.0,6-2,195.0,Duke,1282080.0
427,Cliff Alexander,Portland Trail Blazers,34.0,PF,20.0,6-8,240.0,Kansas,525093.0
...,...,...,...,...,...,...,...,...,...
102,Pablo Prigioni,Los Angeles Clippers,9.0,PG,39.0,6-3,185.0,NaN,947726.0
298,Tim Duncan,San Antonio Spurs,21.0,C,40.0,6-11,250.0,Wake Forest,5250000.0
400,Kevin Garnett,Minnesota Timberwolves,21.0,PF,40.0,6-11,240.0,NaN,8500000.0
304,Andre Miller,San Antonio Spurs,24.0,PG,40.0,6-3,200.0,Utah,250750.0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [30]:
nba.sort_values('Salary') #NaN values would arrange at the end
nba.sort_values('Salary', na_position='last')
# nba.sort_values('Salary', na_position='first')

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
32,Thanasis Antetokounmpo,New York Knicks,43.0,SF,23.0,6-7,205.0,NaN,30888.0
291,Orlando Johnson,New Orleans Pelicans,0.0,SG,27.0,6-5,220.0,UC Santa Barbara,55722.0
130,Phil Pressey,Phoenix Suns,25.0,PG,25.0,5-11,175.0,Missouri,55722.0
135,Alan Williams,Phoenix Suns,15.0,C,23.0,6-8,260.0,UC Santa Barbara,83397.0
175,Jordan McRae,Cleveland Cavaliers,12.0,SG,25.0,6-5,179.0,Tennessee,111196.0
...,...,...,...,...,...,...,...,...,...
350,Briante Weber,Miami Heat,12.0,PG,23.0,6-2,165.0,Virginia Commonwealth,NaN
353,Dorell Wright,Miami Heat,11.0,SF,30.0,6-9,205.0,NaN,NaN
397,Axel Toupane,Denver Nuggets,6.0,SG,23.0,6-7,210.0,NaN,NaN
409,Greg Smith,Minnesota Timberwolves,4.0,PF,25.0,6-10,250.0,Fresno State,NaN
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

# sortvalues() for multi columns in pandas

In [ ]:
import pandas as pd
nba=pd.read_csv('nba.csv')
nba.head()

In [ ]:
nba.sort_values(['Team', 'Name'])
# nba.sort_values(['Team', 'Name'], ascending=[True,False])

# rank() method in pandas

In [ ]:
import pandas as pd
nba=pd.read_csv('nba.csv').dropna(how='all')
nba['Salary']=nba['Salary'].fillna(0).astype('int')
nba.head()

In [ ]:
#I want to decide on the basis of salary, that whose salary is highest comes at rank 1 and so on..
nba['Salary'].rank()
# nba['Salary'][91]
nba['Salary'].rank(ascending=False).astype(int)
nba['Salary Rank']=nba['Salary'].rank(ascending=False).astype(int)
nba.sort_values(by='Salary', ascending=False)
# nba.head()

# Filtering DataFrames in pandas

In [3]:
import pandas as pd
df=pd.read_csv('employees.csv')
df.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services

In [4]:
df.info() #at the end size is there, when we look at the output it is claer that start date and last login time data type is object, but actually they are object iof adte time same as in Senior management has object type but actually it is bool and if correct data type is not there then more memory is required

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         933 non-null    object
 1   Gender             855 non-null    object
 2   Start Date         1000 non-null   object
 3   Last Login Time    1000 non-null   object
 4   Salary             1000 non-null   int64
 5   Bonus %            1000 non-null   float64
 6   Senior Management  933 non-null    object
 7   Team               957 non-null    object
dtypes: float64(1), int64(1), object(6)
memory usage: 62.6+ KB

In [5]:
df['Start Date']

0        8/6/1993
1       3/31/1996
2       4/23/1993
3        3/4/2005
4       1/24/1998
          ...
995    11/23/2014
996     1/31/1984
997     5/20/2013
998     4/20/2013
999     5/15/2012
Name: Start Date, Length: 1000, dtype: object

In [9]:
# pd.to_datetime(df['Start Date'])
df['Start Date']=pd.to_datetime(df['Start Date'])

In [8]:
df['Last Login Time'].head()

0    12:42 PM
1     6:53 AM
2    11:17 AM
3     1:00 PM
4     4:47 PM
Name: Last Login Time, dtype: object

In [11]:
# pd.to_datetime(df['Last Login Time'])
df['Last Login Time']=pd.to_datetime(df['Last Login Time'])

In [12]:
df['Senior Management']=df['Senior Management'].astype(bool)

In [13]:
df['Gender']=df['Gender'].astype('category')

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         933 non-null    object
 1   Gender             855 non-null    category
 2   Start Date         1000 non-null   datetime64[ns]
 3   Last Login Time    1000 non-null   datetime64[ns]
 4   Salary             1000 non-null   int64
 5   Bonus %            1000 non-null   float64
 6   Senior Management  1000 non-null   bool
 7   Team               957 non-null    object
dtypes: bool(1), category(1), datetime64[ns](2), float64(1), int64(1), object(2)
memory usage: 49.1+ KB

In [15]:
#date time can be converted by attribute parse_date available in read_csv method
import pandas as pd
df=pd.read_csv('employees.csv', parse_dates=['Start Date', 'Last Login Time'])
df['Gender']=df['Gender'].astype('category')
df['Senior Management']=df['Senior Management'].astype('bool')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         933 non-null    object
 1   Gender             855 non-null    category
 2   Start Date         1000 non-null   datetime64[ns]
 3   Last Login Time    1000 non-null   datetime64[ns]
 4   Salary             1000 non-null   int64
 5   Bonus %            1000 non-null   float64
 6   Senior Management  1000 non-null   bool
 7   Team               957 non-null    object
dtypes: bool(1), category(1), datetime64[ns](2), float64(1), int64(1), object(2)
memory usage: 49.1+ KB

# Filtering a dataframe based on condition

In [16]:
import pandas as pd
df=pd.read_csv('employees.csv', parse_dates=['Start Date', 'Last Login Time'])
df['Gender']=df['Gender'].astype('category')
df['Senior Management']=df['Senior Management'].astype('bool')
df.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2021-08-18 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2021-08-18 06:53:00,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,2021-08-18 11:17:00,130590,11.858,False,Finance
3,Jerry,Male,2005-03-04,2021-08-18 13:00:00,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,2021-08-18 16:47:00,101004,1.389,True,Client Services

In [17]:
#If i want to apply condition on gender that i want only those value in gender series which are of male category
# df['Gender']
df['mask']=df['Gender']=='Male'
# df
# df[mask]
# df[df['Gender']=='Female'] #This will extract only those value in a column whose value are male

In [18]:
mask1=df['Team']=='Finance'
mask2=df['Gender']=='Male'

# df['Filter']=df[mask1 & mask2]
df[mask1]
df[df['Team']=='Finance']

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team,mask
2,Maria,Female,1993-04-23,2021-08-18 11:17:00,130590,11.858,False,Finance,False
3,Jerry,Male,2005-03-04,2021-08-18 13:00:00,138705,9.340,True,Finance,True
7,NaN,Female,2015-07-20,2021-08-18 10:43:00,45906,11.598,True,Finance,False
14,Kimberly,Female,1999-01-14,2021-08-18 07:13:00,41426,14.543,True,Finance,False
46,Bruce,Male,2009-11-28,2021-08-18 22:47:00,114796,6.796,False,Finance,True
...,...,...,...,...,...,...,...,...,...
907,Elizabeth,Female,1998-07-27,2021-08-18 11:12:00,137144,10.081,False,Finance,False
954,Joe,Male,1980-01-19,2021-08-18 16:06:00,119667,1.148,True,Finance,True
987,Gloria,Female,2014-12-08,2021-08-18 05:08:00,136709,10.331,True,Finance,False
992,Anthony,Male,2011-10-16,2021-08-18 08:35:00,112769,11.625,True,Finance,True
996,Phillip,Male,1984-01-31,2021-08-18 06:30:00,42392,19.675,False,Finance,True

In [19]:
mask=df['Senior Management']
# df[df['Senior Management']] #As senior management data is already in boolean so it can be done directly'
df[mask]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team,mask
0,Douglas,Male,1993-08-06,2021-08-18 12:42:00,97308,6.945,True,Marketing,True
1,Thomas,Male,1996-03-31,2021-08-18 06:53:00,61933,4.170,True,NaN,True
3,Jerry,Male,2005-03-04,2021-08-18 13:00:00,138705,9.340,True,Finance,True
4,Larry,Male,1998-01-24,2021-08-18 16:47:00,101004,1.389,True,Client Services,True
6,Ruby,Female,1987-08-17,2021-08-18 16:20:00,65476,10.012,True,Product,False
...,...,...,...,...,...,...,...,...,...
991,Rose,Female,2002-08-25,2021-08-18 05:12:00,134505,11.051,True,Marketing,False
992,Anthony,Male,2011-10-16,2021-08-18 08:35:00,112769,11.625,True,Finance,True
993,Tina,Female,1997-05-15,2021-08-18 15:53:00,56450,19.040,True,Engineering,False
994,George,Male,2013-06-21,2021-08-18 17:47:00,98874,4.479,True,Marketing,True
999,Albert,Male,2012-05-15,2021-08-18 18:24:00,129949,10.169,True,Sales,True

In [20]:
mask= df['Team'] != 'Marketing'
df[mask]
# df[df['Team'] != 'Marketing'] #condition for not equal to.

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team,mask
1,Thomas,Male,1996-03-31,2021-08-18 06:53:00,61933,4.170,True,NaN,True
2,Maria,Female,1993-04-23,2021-08-18 11:17:00,130590,11.858,False,Finance,False
3,Jerry,Male,2005-03-04,2021-08-18 13:00:00,138705,9.340,True,Finance,True
4,Larry,Male,1998-01-24,2021-08-18 16:47:00,101004,1.389,True,Client Services,True
5,Dennis,Male,1987-04-18,2021-08-18 01:35:00,115163,10.125,False,Legal,True
...,...,...,...,...,...,...,...,...,...
995,Henry,NaN,2014-11-23,2021-08-18 06:09:00,132483,16.655,False,Distribution,False
996,Phillip,Male,1984-01-31,2021-08-18 06:30:00,42392,19.675,False,Finance,True
997,Russell,Male,2013-05-20,2021-08-18 12:39:00,96914,1.421,False,Product,True
998,Larry,Male,2013-04-20,2021-08-18 16:45:00,60500,11.985,False,Business Development,True
999,Albert,Male,2012-05-15,2021-08-18 18:24:00,129949,10.169,True,Sales,True

In [21]:
df[df['Salary']>110000]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team,mask
2,Maria,Female,1993-04-23,2021-08-18 11:17:00,130590,11.858,False,Finance,False
3,Jerry,Male,2005-03-04,2021-08-18 13:00:00,138705,9.340,True,Finance,True
5,Dennis,Male,1987-04-18,2021-08-18 01:35:00,115163,10.125,False,Legal,True
9,Frances,Female,2002-08-08,2021-08-18 06:51:00,139852,7.524,True,Business Development,False
12,Brandon,Male,1980-12-01,2021-08-18 01:08:00,112807,17.492,True,Human Resources,True
...,...,...,...,...,...,...,...,...,...
987,Gloria,Female,2014-12-08,2021-08-18 05:08:00,136709,10.331,True,Finance,False
991,Rose,Female,2002-08-25,2021-08-18 05:12:00,134505,11.051,True,Marketing,False
992,Anthony,Male,2011-10-16,2021-08-18 08:35:00,112769,11.625,True,Finance,True
995,Henry,NaN,2014-11-23,2021-08-18 06:09:00,132483,16.655,False,Distribution,False
999,Albert,Male,2012-05-15,2021-08-18 18:24:00,129949,10.169,True,Sales,True

# Filter Data Frame with AND & OR Operators

In [22]:
import pandas as pd
df=pd.read_csv('employees.csv', parse_dates=['Start Date', 'Last Login Time'])
df['Gender']=df['Gender'].astype('category')
df['Senior Management']=df['Senior Management'].astype('bool')
df.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2021-08-18 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2021-08-18 06:53:00,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,2021-08-18 11:17:00,130590,11.858,False,Finance
3,Jerry,Male,2005-03-04,2021-08-18 13:00:00,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,2021-08-18 16:47:00,101004,1.389,True,Client Services

In [23]:
mask1=df['Gender']=='Male'
mask2=df['Team']=='Marketing'

df[mask1 & mask2]

df[mask1 & mask2].head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2021-08-18 12:42:00,97308,6.945,True,Marketing
21,Matthew,Male,1995-09-05,2021-08-18 02:12:00,100612,13.645,False,Marketing
26,Craig,Male,2000-02-27,2021-08-18 07:45:00,37598,7.757,True,Marketing
74,Thomas,Male,1995-06-04,2021-08-18 14:24:00,62096,17.029,False,Marketing
77,Charles,Male,2004-09-14,2021-08-18 20:13:00,107391,1.260,True,Marketing

In [24]:
mask3=df['Senior Management']
mask4=df['Start Date']< '1990-01-01'

df[mask3 | mask4]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2021-08-18 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2021-08-18 06:53:00,61933,4.170,True,NaN
3,Jerry,Male,2005-03-04,2021-08-18 13:00:00,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,2021-08-18 16:47:00,101004,1.389,True,Client Services
5,Dennis,Male,1987-04-18,2021-08-18 01:35:00,115163,10.125,False,Legal
...,...,...,...,...,...,...,...,...
992,Anthony,Male,2011-10-16,2021-08-18 08:35:00,112769,11.625,True,Finance
993,Tina,Female,1997-05-15,2021-08-18 15:53:00,56450,19.040,True,Engineering
994,George,Male,2013-06-21,2021-08-18 17:47:00,98874,4.479,True,Marketing
996,Phillip,Male,1984-01-31,2021-08-18 06:30:00,42392,19.675,False,Finance
999,Albert,Male,2012-05-15,2021-08-18 18:24:00,129949,10.169,True,Sales

In [25]:
mask5=df['First Name']=='Robert'
mask6=df['Team']=='Client Services'
mask7=df['Start Date']>'2016-06-01'

df[(mask5 & mask6) | mask7]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
15,Lillian,Female,2016-06-05,2021-08-18 06:09:00,59414,1.256,False,Product
98,Tina,Female,2016-06-16,2021-08-18 19:47:00,100705,16.961,True,Marketing
387,Robert,Male,1994-10-29,2021-08-18 04:26:00,123294,19.894,False,Client Services
451,Terry,NaN,2016-07-15,2021-08-18 00:29:00,140002,19.490,True,Marketing

# isin() method in pandas

In [10]:
import pandas as pd
df=pd.read_csv('employees.csv', parse_dates=['Start Date', 'Last Login Time'])
df['Gender']=df['Gender'].astype('category')
df['Senior Management']=df['Senior Management'].astype('bool')
df.head()
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         933 non-null    object
 1   Gender             855 non-null    category
 2   Start Date         1000 non-null   datetime64[ns]
 3   Last Login Time    1000 non-null   datetime64[ns]
 4   Salary             1000 non-null   int64
 5   Bonus %            1000 non-null   float64
 6   Senior Management  1000 non-null   bool
 7   Team               957 non-null    object
dtypes: bool(1), category(1), datetime64[ns](2), float64(1), int64(1), object(2)
memory usage: 49.1+ KB

In [11]:
mask1=df['Team']=='Legal'
mask2=df['Team']=='Sales'
mask3=df['Team']=='Product'

df[mask1 | mask2 | mask3].head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
5,Dennis,Male,1987-04-18,2022-07-08 01:35:00,115163,10.125,False,Legal
6,Ruby,Female,1987-08-17,2022-07-08 16:20:00,65476,10.012,True,Product
11,Julie,Female,1997-10-26,2022-07-08 15:19:00,102508,12.637,True,Legal
13,Gary,Male,2008-01-27,2022-07-08 23:40:00,109831,5.831,False,Sales
15,Lillian,Female,2016-06-05,2022-07-08 06:09:00,59414,1.256,False,Product

In [13]:
#As in above case it is claer that it requires same code for many times so it can be deal with the help of isin() method as in this case we are able to pass multiple arguments

df['Team'].isin(['Legal', 'Sales', 'Product'])

101    False
327    False
440    False
937    False
137    False
       ...
902    False
925     True
946    False
947    False
951    False
Name: Team, Length: 1000, dtype: bool

In [14]:
mask=df['Team'].isin(['Legal', 'Sales', 'Product'])
df[mask] #It is claer that we does not required multiple lines of asme type

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
141,Adam,Male,1990-12-24,2021-08-19 20:57:00,110194,14.727,True,Product
610,Alan,Male,2012-02-17,2021-08-19 00:26:00,41453,10.084,False,Product
999,Albert,Male,2012-05-15,2021-08-19 18:24:00,129949,10.169,True,Sales
970,Alice,Female,1988-09-03,2021-08-19 20:54:00,63571,15.397,True,Product
693,Alice,Female,1995-10-16,2021-08-19 21:19:00,92799,2.782,False,Sales
...,...,...,...,...,...,...,...,...
320,NaN,Female,2008-07-08,2021-08-19 23:40:00,62960,14.356,True,Sales
607,NaN,Male,1983-10-13,2021-08-19 23:59:00,139754,12.740,True,Sales
783,NaN,NaN,1991-04-15,2021-08-19 03:39:00,132505,13.592,True,Product
812,NaN,Male,1994-12-13,2021-08-19 10:34:00,141311,5.478,True,Product
925,NaN,Female,2000-08-23,2021-08-19 16:19:00,95866,19.388,True,Sales

# isnull(), notnull() ,between() and duplicate() method in panda

In [5]:
import pandas as pd
df=pd.read_csv('employees.csv', parse_dates=['Start Date', 'Last Login Time'])
df['Gender']=df['Gender'].astype('category')
df['Senior Management']=df['Senior Management'].astype('bool')
df.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2021-08-19 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2021-08-19 06:53:00,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,2021-08-19 11:17:00,130590,11.858,False,Finance
3,Jerry,Male,2005-03-04,2021-08-19 13:00:00,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,2021-08-19 16:47:00,101004,1.389,True,Client Services

In [6]:
#isnull() if you want to extract null values
mask=df['Team'].isnull()
df[mask]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
1,Thomas,Male,1996-03-31,2021-08-19 06:53:00,61933,4.170,True,NaN
10,Louise,Female,1980-08-12,2021-08-19 09:01:00,63241,15.132,True,NaN
23,NaN,Male,2012-06-14,2021-08-19 16:19:00,125792,5.042,True,NaN
32,NaN,Male,1998-08-21,2021-08-19 14:27:00,122340,6.417,True,NaN
91,James,NaN,2005-01-26,2021-08-19 23:00:00,128771,8.309,False,NaN
109,Christopher,Male,2000-04-22,2021-08-19 10:15:00,37919,11.449,False,NaN
139,NaN,Female,1990-10-03,2021-08-19 01:08:00,132373,10.527,True,NaN
199,Jonathan,Male,2009-07-17,2021-08-19 08:15:00,130581,16.736,True,NaN
258,Michael,Male,2002-01-24,2021-08-19 03:04:00,43586,12.659,False,NaN
290,Jeremy,Male,1988-06-14,2021-08-19 18:20:00,129460,13.657,True,NaN
314,Bobby,Male,1996-03-31,2021-08-19 17:40:00,112117,6.338,False,NaN
367,Edward,Male,1989-08-04,2021-08-19 06:06:00,66067,10.957,True,NaN
382,NaN,Female,1996-04-18,2021-08-19 15:57:00,107024,12.182,True,NaN
434,Joyce,Female,1995-02-07,2021-08-19 07:38:00,50701,14.227,True,NaN
438,Jason,Male,1998-11-20,2021-08-19 14:54:00,69244,6.220,True,NaN
445,Chris,Male,2006-12-12,2021-08-19 01:57:00,71642,1.496,False,NaN
479,Richard,Male,1997-07-04,2021-08-19 11:47:00,47647,18.787,True,NaN
512,Wanda,Female,1993-04-06,2021-08-19 03:11:00,78883,19.695,False,NaN
513,Jimmy,Male,2013-11-19,2021-08-19 19:29:00,63549,19.624,False,NaN
520,Peter,Male,2003-02-22,2021-08-19 09:09:00,56580,8.411,True,NaN
567,NaN,Female,1980-04-01,2021-08-19 20:04:00,48141,12.605,True,NaN
573,Kimberly,Female,1981-12-30,2021-08-19 04:51:00,81800,5.435,True,NaN
580,Harry,Male,1985-01-27,2021-08-19 20:18:00,65482,18.089,False,NaN
626,NaN,Female,1997-04-13,2021-08-19 08:03:00,131755,2.930,True,NaN
634,Carl,Male,1987-03-30,2021-08-19 17:59:00,75598,19.289,False,NaN
635,Randy,Male,2000-09-27,2021-08-19 03:04:00,89831,13.047,True,NaN
647,Donald,Male,1988-04-06,2021-08-19 10:00:00,122920,5.320,False,NaN
669,Joseph,NaN,1982-03-28,2021-08-19 13:05:00,86564,11.879,True,NaN
684,Alice,Female,2016-01-21,2021-08-19 17:07:00,117787,10.485,False,NaN
706,Todd,Male,1993-07-04,2021-08-19 18:53:00,128175,18.473,True,NaN
726,Daniel,Male,2016-02-29,2021-08-19 04:04:00,77287,13.000,True,NaN
753,Antonio,Male,1999-06-06,2021-08-19 22:54:00,41928,5.478,True,NaN
774,NaN,Female,2000-06-18,2021-08-19 07:36:00,106428,10.867,True,NaN
781,Lawrence,Male,1995-07-03,2021-08-19 22:55:00,46378,9.127,False,NaN
794,Nicole,Female,2004-03-01,2021-08-19 17:17:00,44021,10.286,False,NaN
826,NaN,NaN,1988-08-01,2021-08-19 01:35:00,87103,5.665,True,NaN
850,Charles,Male,1997-09-03,2021-08-19 10:04:00,148291,6.002,False,NaN
851,Bobby,Male,1996-08-19,2021-08-19 01:16:00,147842,16.158,True,NaN
853,Mildred,Female,2007-04-06,2021-08-19 22:06:00,139284,11.390,True,NaN
855,Phillip,NaN,2003-10-20,2021-08-19 11:09:00,89700,2.277,True,NaN
864,Ryan,Male,2012-11-16,2021-08-19 13:47:00,57292,6.010,False,NaN
912,Joe,Male,1998-12-08,2021-08-19 10:28:00,126120,1.020,False,NaN
951,NaN,Female,2010-09-14,2021-08-19 05:19:00,143638,9.662,True,NaN

In [8]:
mask1=df['Team'].isnull()
mask2=df['Gender'].isnull()


df [ mask1 | mask2]
# df[df['Team'].notnull()]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
1,Thomas,Male,1996-03-31,2021-08-19 06:53:00,61933,4.170,True,NaN
10,Louise,Female,1980-08-12,2021-08-19 09:01:00,63241,15.132,True,NaN
20,Lois,NaN,1995-04-22,2021-08-19 19:18:00,64714,4.934,True,Legal
22,Joshua,NaN,2012-03-08,2021-08-19 01:58:00,90816,18.816,True,Client Services
23,NaN,Male,2012-06-14,2021-08-19 16:19:00,125792,5.042,True,NaN
...,...,...,...,...,...,...,...,...
961,Antonio,NaN,1989-06-18,2021-08-19 21:37:00,103050,3.050,False,Legal
972,Victor,NaN,2006-07-28,2021-08-19 14:49:00,76381,11.159,True,Sales
985,Stephen,NaN,1983-07-10,2021-08-19 20:10:00,85668,1.909,False,Legal
989,Justin,NaN,1991-02-10,2021-08-19 16:58:00,38344,3.794,False,Legal
995,Henry,NaN,2014-11-23,2021-08-19 06:09:00,132483,16.655,False,Distribution

In [9]:
#between()
# df['Salary'].between(60000, 70000)
df[df['Salary'].between(60000, 70000)]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
1,Thomas,Male,1996-03-31,2021-08-19 06:53:00,61933,4.170,True,NaN
6,Ruby,Female,1987-08-17,2021-08-19 16:20:00,65476,10.012,True,Product
10,Louise,Female,1980-08-12,2021-08-19 09:01:00,63241,15.132,True,NaN
20,Lois,NaN,1995-04-22,2021-08-19 19:18:00,64714,4.934,True,Legal
41,Christine,NaN,2015-06-28,2021-08-19 01:08:00,66582,11.308,True,Business Development
...,...,...,...,...,...,...,...,...
965,Catherine,Female,1989-09-25,2021-08-19 01:31:00,68164,18.393,False,Client Services
970,Alice,Female,1988-09-03,2021-08-19 20:54:00,63571,15.397,True,Product
974,Harry,Male,2011-08-30,2021-08-19 18:31:00,67656,16.455,True,Client Services
978,Sean,Male,1983-01-17,2021-08-19 14:23:00,66146,11.178,False,Human Resources
998,Larry,Male,2013-04-20,2021-08-19 16:45:00,60500,11.985,False,Business Development

In [10]:
df['Bonus %'].between(2.0, 5.0)
df[df['Bonus %'].between(2.0, 5.0)]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
1,Thomas,Male,1996-03-31,2021-08-19 06:53:00,61933,4.170,True,NaN
20,Lois,NaN,1995-04-22,2021-08-19 19:18:00,64714,4.934,True,Legal
40,Michael,Male,2008-10-10,2021-08-19 11:25:00,99283,2.665,True,Distribution
49,Chris,NaN,1980-01-24,2021-08-19 12:13:00,113590,3.055,False,Sales
60,Paula,NaN,2005-11-23,2021-08-19 14:01:00,48866,4.271,False,Distribution
...,...,...,...,...,...,...,...,...
943,Wayne,Male,2006-09-08,2021-08-19 11:09:00,67471,2.728,False,Engineering
961,Antonio,NaN,1989-06-18,2021-08-19 21:37:00,103050,3.050,False,Legal
976,Denise,Female,1992-10-19,2021-08-19 05:42:00,137954,4.195,True,Legal
989,Justin,NaN,1991-02-10,2021-08-19 16:58:00,38344,3.794,False,Legal
994,George,Male,2013-06-21,2021-08-19 17:47:00,98874,4.479,True,Marketing

In [11]:
df['Start Date'].between("1991-01-01", "1992-01-01")
df[df['Start Date'].between("1991-01-01", "1992-01-01")]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
27,Scott,NaN,1991-07-11,2021-08-19 18:58:00,122367,5.218,False,Legal
75,Bonnie,Female,1991-07-02,2021-08-19 01:27:00,104897,5.118,True,Human Resources
88,Donna,Female,1991-11-27,2021-08-19 13:59:00,64088,6.155,True,Legal
116,NaN,Male,1991-06-22,2021-08-19 20:58:00,76189,18.988,True,Legal
148,Patrick,NaN,1991-07-14,2021-08-19 02:24:00,124488,14.837,True,Sales
166,NaN,Female,1991-07-09,2021-08-19 18:52:00,42341,7.014,True,Sales
172,Sara,Female,1991-09-23,2021-08-19 18:17:00,97058,9.402,False,Finance
220,NaN,Female,1991-06-17,2021-08-19 12:49:00,71945,5.560,True,Marketing
245,Victor,Male,1991-04-11,2021-08-19 07:44:00,70817,17.138,False,Engineering
277,Brenda,NaN,1991-05-29,2021-08-19 06:32:00,82439,19.062,False,Sales
313,Judy,Female,1991-07-01,2021-08-19 02:33:00,109510,13.457,True,Legal
328,Samuel,Male,1991-12-19,2021-08-19 02:54:00,76076,5.319,True,Finance
339,Michael,Male,1991-11-22,2021-08-19 12:57:00,98753,16.443,True,Human Resources
537,Cynthia,Female,1991-09-14,2021-08-19 13:08:00,51633,13.472,True,Business Development
552,Barbara,Female,1991-09-02,2021-08-19 15:41:00,127297,11.905,True,Product
603,Carl,NaN,1991-10-26,2021-08-19 08:11:00,100888,12.490,True,Business Development
639,Amanda,NaN,1991-08-11,2021-08-19 14:15:00,46665,19.391,True,Client Services
704,Thomas,Male,1991-09-07,2021-08-19 09:51:00,65251,11.211,False,Distribution
725,Jeremy,Male,1991-05-19,2021-08-19 13:40:00,131513,1.876,True,Finance
766,Justin,Male,1991-07-25,2021-08-19 00:45:00,112975,9.699,False,Human Resources
771,Peter,Male,1991-05-22,2021-08-19 01:39:00,102577,12.026,True,Product
783,NaN,NaN,1991-04-15,2021-08-19 03:39:00,132505,13.592,True,Product
891,Timothy,Male,1991-08-25,2021-08-19 10:37:00,92587,8.475,False,Finance
895,Janice,NaN,1991-11-19,2021-08-19 18:02:00,139791,16.968,False,Business Development
909,Donald,Male,1991-08-01,2021-08-19 02:25:00,61999,6.466,False,Product
923,Irene,NaN,1991-02-28,2021-08-19 22:23:00,135369,4.380,False,Business Development
989,Justin,NaN,1991-02-10,2021-08-19 16:58:00,38344,3.794,False,Legal

In [12]:
#duplicate() method
df.sort_values('First Name', inplace=True)
# df['First Name']=df.sort_values('First Name')
df['First Name']

101    Aaron
327    Aaron
440    Aaron
937    Aaron
137     Adam
       ...
902      NaN
925      NaN
946      NaN
947      NaN
951      NaN
Name: First Name, Length: 1000, dtype: object

In [15]:
df['First Name'].duplicated(keep='last') #it says that first value is not duplicate as in parameter it has keep=first you may change it to last also

101     True
327     True
440     True
937    False
137     True
       ...
902     True
925     True
946     True
947     True
951    False
Name: First Name, Length: 1000, dtype: bool

In [ ]:
 df[df['First Name'].duplicated(keep=False)].head()

In [ ]:
mask = ~ df[df['First Name'].duplicated(keep=False)].head() #reverse operation of duplicate so ir gives unique value from data sets

In [ ]:
#drop duplicate method\
len(df)

In [ ]:
len(df.drop_duplicates())

In [ ]:
df.drop_duplicates(subset=['First Name'], keep='first')
len( df.drop_duplicates(subset=['First Name'], keep='first'))

In [ ]:
df.drop_duplicates(subset=['First Name', 'Team'], keep='last').head()

# Retrieve row values using loc() method in pandas

In [16]:
import pandas as pd
bond=pd.read_csv('jamesbond.csv', index_col='Film')
bond.sort_index(inplace=True)
# short by alphabets
bond.head()

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
A View to a Kill,1985,Roger Moore,John Glen,275.2,54.5,9.1
Casino Royale,2006,Daniel Craig,Martin Campbell,581.5,145.3,3.3
Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,NaN
Diamonds Are Forever,1971,Sean Connery,Guy Hamilton,442.5,34.7,5.8
Die Another Day,2002,Pierce Brosnan,Lee Tamahori,465.4,154.2,17.9

In [17]:
bond.loc['Casino Royale']
# to extract a row

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
Casino Royale,2006,Daniel Craig,Martin Campbell,581.5,145.3,3.3
Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,NaN

In [18]:
bond.loc['GoldenEye']

Year                            1995
Actor                 Pierce Brosnan
Director             Martin Campbell
Box Office                     518.5
Budget                          76.9
Bond Actor Salary                5.1
Name: GoldenEye, dtype: object

In [19]:
bond.loc['Casino Royale']

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
Casino Royale,2006,Daniel Craig,Martin Campbell,581.5,145.3,3.3
Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,NaN

In [23]:
# bond.loc['Diamonds are Forever': 'Moonracker']
# bond.loc['GoldenEye':]
bond.loc[: "On Her Majesty's Secret Services"]

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
A View to a Kill,1985,Roger Moore,John Glen,275.2,54.5,9.1
Casino Royale,2006,Daniel Craig,Martin Campbell,581.5,145.3,3.3
Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,NaN
Diamonds Are Forever,1971,Sean Connery,Guy Hamilton,442.5,34.7,5.8
Die Another Day,2002,Pierce Brosnan,Lee Tamahori,465.4,154.2,17.9
Dr. No,1962,Sean Connery,Terence Young,448.8,7.0,0.6
For Your Eyes Only,1981,Roger Moore,John Glen,449.4,60.2,NaN
From Russia with Love,1963,Sean Connery,Terence Young,543.8,12.6,1.6
GoldenEye,1995,Pierce Brosnan,Martin Campbell,518.5,76.9,5.1
Goldfinger,1964,Sean Connery,Guy Hamilton,820.4,18.6,3.2
Licence to Kill,1989,Timothy Dalton,John Glen,250.9,56.7,7.9
Live and Let Die,1973,Roger Moore,Guy Hamilton,460.3,30.8,NaN
Moonraker,1979,Roger Moore,Lewis Gilbert,535.0,91.5,NaN
Never Say Never Again,1983,Sean Connery,Irvin Kershner,380.0,86.0,NaN
Octopussy,1983,Roger Moore,John Glen,373.8,53.9,7.8
On Her Majesty's Secret Service,1969,George Lazenby,Peter R. Hunt,291.5,37.3,0.6

In [24]:
bond.loc[["For Your Eyes Only", "Live and Let Die"]]

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
For Your Eyes Only,1981,Roger Moore,John Glen,449.4,60.2,NaN
Live and Let Die,1973,Roger Moore,Guy Hamilton,460.3,30.8,NaN

#  Retrieve row values using iloc() method in pandas

In [27]:
import pandas as pd
bond=pd.read_csv('jamesbond.csv')
bond.head(16)

,Film,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
0,Dr. No,1962,Sean Connery,Terence Young,448.8,7.0,0.6
1,From Russia with Love,1963,Sean Connery,Terence Young,543.8,12.6,1.6
2,Goldfinger,1964,Sean Connery,Guy Hamilton,820.4,18.6,3.2
3,Thunderball,1965,Sean Connery,Terence Young,848.1,41.9,4.7
4,Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,NaN
5,You Only Live Twice,1967,Sean Connery,Lewis Gilbert,514.2,59.9,4.4
6,On Her Majesty's Secret Service,1969,George Lazenby,Peter R. Hunt,291.5,37.3,0.6
7,Diamonds Are Forever,1971,Sean Connery,Guy Hamilton,442.5,34.7,5.8
8,Live and Let Die,1973,Roger Moore,Guy Hamilton,460.3,30.8,NaN
9,The Man with the Golden Gun,1974,Roger Moore,Guy Hamilton,334.0,27.7,NaN
10,The Spy Who Loved Me,1977,Roger Moore,Lewis Gilbert,533.0,45.1,NaN
11,Moonraker,1979,Roger Moore,Lewis Gilbert,535.0,91.5,NaN
12,For Your Eyes Only,1981,Roger Moore,John Glen,449.4,60.2,NaN
13,Never Say Never Again,1983,Sean Connery,Irvin Kershner,380.0,86.0,NaN
14,Octopussy,1983,Roger Moore,John Glen,373.8,53.9,7.8
15,A View to a Kill,1985,Roger Moore,John Glen,275.2,54.5,9.1

In [26]:
# bond.loc[15]
bond.iloc[15]
# it extract a specific row

Film                 A View to a Kill
Year                             1985
Actor                     Roger Moore
Director                    John Glen
Box Office                      275.2
Budget                           54.5
Bond Actor Salary                 9.1
Name: 15, dtype: object

In [32]:
bond.iloc[[15,20]]
# bond.iloc[:4]
# bond.iloc[4:8]
# bond.iloc[0:20:2]

# MOST IMP

,Film,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
15,A View to a Kill,1985,Roger Moore,John Glen,275.2,54.5,9.1
20,The World Is Not Enough,1999,Pierce Brosnan,Michael Apted,439.5,158.3,13.5

# Retrive row values using ix() methods in pandas

In [36]:
# In case of ix it has both the capability of loc and iloc
import pandas as pd
bond=pd.read_csv('jamesbond.csv', index_col='Film')
bond.sort_index(inplace=True)
bond.head()

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
A View to a Kill,1985,Roger Moore,John Glen,275.2,54.5,9.1
Casino Royale,2006,Daniel Craig,Martin Campbell,581.5,145.3,3.3
Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,NaN
Diamonds Are Forever,1971,Sean Connery,Guy Hamilton,442.5,34.7,5.8
Die Another Day,2002,Pierce Brosnan,Lee Tamahori,465.4,154.2,17.9

In [37]:
bond.loc['GoldenEye']
bond.ix['GoldenEye']

AttributeError: 'DataFrame' object has no attribute 'ix'

In [ ]:
bond.ix[[ 'Moonraker', 'Spectre']]

In [ ]:
'Spectre' in bond.index
'Sacred Bond' in bond.index
bond.index
bond.values

In [ ]:
bond.ix[0] #It shows that ix will be taken data as loc and iloc both

# Second argument of iloc, loc and ix methods

In [ ]:
import pandas as pd
bond=pd.read_csv('jamesbond.csv', index_col='Film')
bond.sort_index(inplace=True)
bond.head()

In [ ]:
bond.loc['Moonraker', 'Actor']
# bond.loc['Moonraker', 'Director']
# bond.loc['Moonraker', 'Actor':'Budget']
bond.loc['Moonraker', ['Year', 'Director', 'Budget']]
# #Similarly we can use it with iloc and ix

# Set new values or a specific cell or Row in pandas

In [38]:
import pandas as pd
bond=pd.read_csv('jamesbond.csv', index_col='Film')
bond.sort_index(inplace=True)
bond.head()

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
A View to a Kill,1985,Roger Moore,John Glen,275.2,54.5,9.1
Casino Royale,2006,Daniel Craig,Martin Campbell,581.5,145.3,3.3
Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,NaN
Diamonds Are Forever,1971,Sean Connery,Guy Hamilton,442.5,34.7,5.8
Die Another Day,2002,Pierce Brosnan,Lee Tamahori,465.4,154.2,17.9

In [ ]:
bond.ix['Dr. No']

In [ ]:
#For eg i want to change the name of the actor
bond.ix['Dr. No', 'Actor']='Sir Sean Connery'
bond.ix['Dr. No', 'Actor']

In [ ]:
bond.ix['Dr. No', ['Box Office', 'Budget', 'Bond Actor Salary']]=[470, 9, 6]

In [ ]:
bond.ix['Dr. No']

# Set Multiple values in DataFrames in pandas

In [39]:
import pandas as pd
bond=pd.read_csv('jamesbond.csv', index_col='Film')
bond.sort_index(inplace=True)
bond.head()

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
A View to a Kill,1985,Roger Moore,John Glen,275.2,54.5,9.1
Casino Royale,2006,Daniel Craig,Martin Campbell,581.5,145.3,3.3
Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,NaN
Diamonds Are Forever,1971,Sean Connery,Guy Hamilton,442.5,34.7,5.8
Die Another Day,2002,Pierce Brosnan,Lee Tamahori,465.4,154.2,17.9

In [ ]:
mask=bond['Actor']=='Sean Connery'
bond[mask]

In [ ]:
bond[mask]['Actor']='Sir Sean Connery'

In [41]:
df2=bond[mask]
df2['Actor']='Sir Sean Connery'
df2

C:\Users\Parekh\AppData\Local\Temp/ipykernel_22492/108644777.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  df2=bond[mask]

IndexingError: Unalignable boolean Series provided as indexer (index of the boolean Series and of the indexed object do not match).

In [ ]:
bond

In [ ]:
bond.ix[mask]
bond.ix[mask,'Actor']='Sir Sean Connery'
bond

# Rename Index Labels or Columns in pandas

In [ ]:
import pandas as pd
bond=pd.read_csv('jamesbond.csv', index_col='Film')
bond.sort_index(inplace=True)
bond.head()

In [40]:
bond.rename(columns={'Year':'Release date', 'Box Office' : 'Revenue'}, inplace=True)
bond.head()

,Release date,Actor,Director,Revenue,Budget,Bond Actor Salary
Film,,,,,,
A View to a Kill,1985,Roger Moore,John Glen,275.2,54.5,9.1
Casino Royale,2006,Daniel Craig,Martin Campbell,581.5,145.3,3.3
Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,NaN
Diamonds Are Forever,1971,Sean Connery,Guy Hamilton,442.5,34.7,5.8
Die Another Day,2002,Pierce Brosnan,Lee Tamahori,465.4,154.2,17.9

In [ ]:
bond.rename(index={'Dr. No':'Doctor No', 'GoldenEye':'Golden Eye','The World Is Not Enough': 'Best Bond Movie'})

# Query Methods in Pandas

In [42]:
#Query methods only applys when all the column are strings and no space in between columns name

import pandas as pd
bond=pd.read_csv('jamesbond.csv', index_col='Film')
bond.sort_index(inplace=True)
bond.head()

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
A View to a Kill,1985,Roger Moore,John Glen,275.2,54.5,9.1
Casino Royale,2006,Daniel Craig,Martin Campbell,581.5,145.3,3.3
Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,NaN
Diamonds Are Forever,1971,Sean Connery,Guy Hamilton,442.5,34.7,5.8
Die Another Day,2002,Pierce Brosnan,Lee Tamahori,465.4,154.2,17.9

In [43]:
bond.columns=[column_names.replace(" ",  "_") for column_names in bond.columns]
bond.head()

,Year,Actor,Director,Box_Office,Budget,Bond_Actor_Salary
Film,,,,,,
A View to a Kill,1985,Roger Moore,John Glen,275.2,54.5,9.1
Casino Royale,2006,Daniel Craig,Martin Campbell,581.5,145.3,3.3
Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,NaN
Diamonds Are Forever,1971,Sean Connery,Guy Hamilton,442.5,34.7,5.8
Die Another Day,2002,Pierce Brosnan,Lee Tamahori,465.4,154.2,17.9

In [44]:
bond.query('Actor=="Sean Connery"')

,Year,Actor,Director,Box_Office,Budget,Bond_Actor_Salary
Film,,,,,,
Diamonds Are Forever,1971,Sean Connery,Guy Hamilton,442.5,34.7,5.8
Dr. No,1962,Sean Connery,Terence Young,448.8,7.0,0.6
From Russia with Love,1963,Sean Connery,Terence Young,543.8,12.6,1.6
Goldfinger,1964,Sean Connery,Guy Hamilton,820.4,18.6,3.2
Never Say Never Again,1983,Sean Connery,Irvin Kershner,380.0,86.0,NaN
Thunderball,1965,Sean Connery,Terence Young,848.1,41.9,4.7
You Only Live Twice,1967,Sean Connery,Lewis Gilbert,514.2,59.9,4.4

In [45]:
bond.query("Director=='Terence Young'")

,Year,Actor,Director,Box_Office,Budget,Bond_Actor_Salary
Film,,,,,,
Dr. No,1962,Sean Connery,Terence Young,448.8,7.0,0.6
From Russia with Love,1963,Sean Connery,Terence Young,543.8,12.6,1.6
Thunderball,1965,Sean Connery,Terence Young,848.1,41.9,4.7

In [46]:
bond.query("Actor != 'Roger Moore'")

,Year,Actor,Director,Box_Office,Budget,Bond_Actor_Salary
Film,,,,,,
Casino Royale,2006,Daniel Craig,Martin Campbell,581.5,145.3,3.3
Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,NaN
Diamonds Are Forever,1971,Sean Connery,Guy Hamilton,442.5,34.7,5.8
Die Another Day,2002,Pierce Brosnan,Lee Tamahori,465.4,154.2,17.9
Dr. No,1962,Sean Connery,Terence Young,448.8,7.0,0.6
From Russia with Love,1963,Sean Connery,Terence Young,543.8,12.6,1.6
GoldenEye,1995,Pierce Brosnan,Martin Campbell,518.5,76.9,5.1
Goldfinger,1964,Sean Connery,Guy Hamilton,820.4,18.6,3.2
Licence to Kill,1989,Timothy Dalton,John Glen,250.9,56.7,7.9
Never Say Never Again,1983,Sean Connery,Irvin Kershner,380.0,86.0,NaN
On Her Majesty's Secret Service,1969,George Lazenby,Peter R. Hunt,291.5,37.3,0.6
Quantum of Solace,2008,Daniel Craig,Marc Forster,514.2,181.4,8.1
Skyfall,2012,Daniel Craig,Sam Mendes,943.5,170.2,14.5
Spectre,2015,Daniel Craig,Sam Mendes,726.7,206.3,NaN
The Living Daylights,1987,Timothy Dalton,John Glen,313.5,68.8,5.2
The World Is Not Enough,1999,Pierce Brosnan,Michael Apted,439.5,158.3,13.5
Thunderball,1965,Sean Connery,Terence Young,848.1,41.9,4.7
Tomorrow Never Dies,1997,Pierce Brosnan,Roger Spottiswoode,463.2,133.9,10.0
You Only Live Twice,1967,Sean Connery,Lewis Gilbert,514.2,59.9,4.4

In [47]:
bond.query("Box_Office>600")

,Year,Actor,Director,Box_Office,Budget,Bond_Actor_Salary
Film,,,,,,
Goldfinger,1964,Sean Connery,Guy Hamilton,820.4,18.6,3.2
Skyfall,2012,Daniel Craig,Sam Mendes,943.5,170.2,14.5
Spectre,2015,Daniel Craig,Sam Mendes,726.7,206.3,NaN
Thunderball,1965,Sean Connery,Terence Young,848.1,41.9,4.7

In [50]:
bond.query("Actor=='Roger Moore' & Director=='John Glen'")

,Year,Actor,Director,Box_Office,Budget,Bond_Actor_Salary
Film,,,,,,
A View to a Kill,1985,Roger Moore,John Glen,275.2,54.5,9.1
For Your Eyes Only,1981,Roger Moore,John Glen,449.4,60.2,NaN
Octopussy,1983,Roger Moore,John Glen,373.8,53.9,7.8